Q1. What is a database?Differentiate between SQL and NoSQL databases.

Ans-

#### Database-

A database is an organized collection of data stored in a computer system and usually controlled by a database management system (DBMS).The data in common databases is modeled in tables,making querying and processing efficient.

Structured query language (SQL) is commonly used for data querying and writing.

Examples--

In the bank,In school,In the railway station,In a grocery store,etc.. These are the instances where we need to store a large amount of data in one place and fetch these data easily.

#### SQL vs NoSQL-

1)	Databases are categorized as Relational Database Management System (RDBMS).

NoSQL databases are categorized as Non-relational or distributed database system.

2)	SQL databases have fixed or static or predefined schema.	

NoSQL databases have dynamic schema.

3)	SQL databases display data in form of tables so it is known as table-based database. 

NoSQL databases display data as collection of key-value pair, documents, graph databases or wide-column stores.

4)	SQL databases are vertically scalable. 

NoSQL databases are horizontally scalable.

5)	SQL databases use a powerful language "Structured Query Language" to define and manipulate the data.

 In NoSQL databases, collection of documents are used to query the data. It is also called unstructured query language. It varies from database to database.

6)	SQL databases are best suited for complex queries.	

NoSQL databases are not so good for complex queries because these are not as powerful as SQL queries.

7)	SQL databases are not best suited for hierarchical data storage.	

NoSQL databases are best suited for hierarchical data storage.

8)	MySQL, Oracle, Sqlite, PostgreSQL and MS-SQL etc. are the example of SQL database.

MongoDB, BigTable, Redis, RavenDB, Cassandra, Hbase, Neo4j, CouchDB etc. are the example of nosql database.

Q2.What is DDL?Explain why CREATE,DROP,ALTER,and TRUNCATE are used with an example.

Ans-

#### DDL-

Data Definition Language(DDL) is a subset of SQL and a part of DBMS(Database Management System). DDL consist of Commands to commands like CREATE, ALTER, TRUNCATE and DROP. These commands are used to create or modify the tables in SQL.

#### DDL Commands-

1.Create
2.Alter 
3.truncate
4.drop
5.Rename

Command-1 :

CREATE :

This command is used to create a new table in SQL. The user has to give information like table name, column names, and their datatypes.

Syntax –

CREATE TABLE table_name
(
column_1 datatype,
column_2 datatype,
column_3 datatype,
....
);

Example –

We need to create a table for storing Student information of a particular College. Create syntax would be as below.

CREATE TABLE Student_info
(
College_Id number(2),
College_name varchar(30),
Branch varchar(10)
);

----------------------------------------------------------------

Command-2 :

ALTER :

This command is used to add, delete or change columns in the existing table. The user needs to know the existing table name and can do add, delete or modify tasks easily.

Syntax –

Syntax to add a column to an existing table.

ALTER TABLE table_name
ADD column_name datatype;

Example –

In our Student_info table, we want to add a new column for CGPA. The syntax would be as below as follows.

ALTER TABLE Student_info
ADD CGPA number;

----------------------------------------------------------------

Command-3 :

TRUNCATE :

This command is used to remove all rows from the table, but the structure of the table still exists.

Syntax –

Syntax to remove an existing table.

TRUNCATE TABLE table_name;

Example –

The College Authority wants to remove the details of all students for new batches but wants to keep the table structure. The command they can use is as follows.

TRUNCATE TABLE Student_info;

----------------------------------------------------------------

Command-4 :

DROP :

This command is used to remove an existing table along with its structure from the Database.

Syntax –

Syntax to drop an existing table.

DROP TABLE table_name;

Example –

If the College Authority wants to change their Database by deleting the Student_info Table. 

DROP TABLE Student_info;

----------------------------------------------------------------

Command -5

RENAME:

It is possible to change name of table with or without data in it using simple RENAME command.

We can rename any table object at any point of time.

Syntax –

RENAME TABLE <#Table Name> To <#New_Table_Name>;

Note : Ignore # in Table Name and New_Table_Name.

Example:

If you want to change the name of the table from Employee to Emp we can use rename command as 

RENAME TABLE Employee To EMP;

Q3.What is DML?Explain INSERT,UPDATE,and DELETE with an example.

Ans-

#### DML -

DML stands for Data Manipulation Language.The purpose of DML is to select,insert,update,and delete data in a database.The DML commands in SQL modify or change the data present in the database.

These commands are not auto-committed.This means they can't permanently save all the changes in the database.However, they can roll back using the DML commands themselves.

#### DML Commands -

1.SELECT
2.INSERT
3.UPDATE
4.DELETE

#### 1. INSERT COMMAND:

It is a command to insert data into the table’s columns. The user must check the table to see whether it has any integrity constraints, such as PRIMARY KEY, UNIQUE, NOT NULL, etc., and enter records accordingly. 

Things to keep in mind while inserting data into the table using the INSERT command: 

Enclose the string within a single quote,''.

Write the date as YYYY/MM/DD and enclose it within a single quote.

Mention the data type along with the column name.

Follow all INTEGRITY constraints. They are the rules for data being stored in the table.

Syntax-


INSERT INTO table_name (column_1 data type, column_2 data type,…,column_N data type)VALUES (value 1, value 2, value 3,…, value N);

#### Example 1 – 

Consider an empty table called “Employee” that will contain details of all employees. The structure of the Employee table is as follows:

| Emp_ID | Emp_Name | Emp_Age | Emp_City | Salary |

Let us add a record of an employee to this table using the DML command INSERT.

INSERT INTO Employee (Emp_ID int, 'Emp_Name' varchar(20), Emp_Age int, 'Emp_City' varchar(20), Salary int)

VALUES (1, 'Satish', 25, 'Pune', 20000);

INSERT INTO Employee (Emp_ID int, 'Emp_Name' varchar(20), Emp_Age int, 'Emp_City' varchar(20), Salary int)

VALUES (2, 'Ram', 26, 'Pune', 21000);

#### 2. SELECT COMMAND

It is used to select and retrieve data from the database table. Note that it does not manipulate data. The SELECT command is also known as data query language because it is used to query information from a database table. 

In the SELECT statement, the table name and column names are specified. It returns data in the form of a result table. These result tables are called “result sets”. 

Various ‘clauses’ that go with the SELECT command are: WHERE, GROUP BY, HAVING, ORDER BY, AS, and DISTINCT. These clauses help filter the results stated in the SELECT clauses.


WHERE Clause: It specifies which row to retrieve from the database.

GROUP BY Clause: It is used to arrange data into groups so that aggregate functions can be applied.

HAVING Clause: It selects among groups defined by the Group By clause by specifying conditions.

ORDER BY Clause: It specifies the order in which to return the rows.

AS Clause: It is used to give a column or table with a temporary name.

DISTINCT Clause: Its use is to remove duplicates from the result set of a SELECT statement (SELECT DISTINCT).

Syntax – 

SELECT column_name1, column_name2,…FROM table_name;

#### Example -

 To see all the records in the table Employee, there is no need to specify every column name in the statement. You can simply use * asterisk with the SELECT command. This * asterisk mark in SQL recognizes all the columns and a complete table will appear.

SELECT * FROM Employee;

#### 3. UPDATE COMMAND

This DML command in SQL modifies the record present in the existing table. It updates the records by using a WHERE clause that specifies the condition with an UPDATE statement. You need to mention the condition, otherwise, all the rows will be affected. 

Syntax – 

UPDATE table_name

SET column 1 = value 1, column 2 = value 2,…, column N = value N

WHERE CONDITION;

#### Example – 

UPDATE Employee

SET Address = ‘Chennai’

WHERE Emp_ID = 2;

#### 4. DELETE Command

It is used to delete some or all of the records from the existing table. It should contain the WHERE clause to give the condition. It is necessary to mention the WHERE condition to delete the selected rows; otherwise, it will delete all the data.

Syntax –

DELETE FROM table_name

WHERE condition;

#### Example – 

DELETE FROM Employee

WHERE Address = ‘Pune’;